In [28]:
# Persiapan membuat data
import pandas as pd
import random

pelajaran = ['Matematika', 'Fisika', 'Biologi', 'Kimia', 'Geologi', 'Ekonomi']
kelas = ['12A', '12B', '12C', '12D']

hasil_nilai = {
    'siswa_id' : range(1, 21),
    'pelajaran' : [random.choice(pelajaran) for i in range(20)],
    'nilai' : [random.choice(range(0, 100)) for i in range(20)],
    'jenis_kelamin' : [random.choice(['laki-laki', 'perempuan']) for i in range(20)],
    'kelas' : [random.choice(kelas) for i in range(20)]
}

df = pd.DataFrame(hasil_nilai)
df.head()

   siswa_id   pelajaran  nilai jenis_kelamin kelas
0         1  Matematika     32     perempuan   12B
1         2  Matematika     35     perempuan   12C
2         3     Ekonomi     24     laki-laki   12C
3         4       Kimia     27     perempuan   12D
4         5       Kimia     63     perempuan   12D

<h2>Soal 1: Indexing</h2>

1. Lakukan indexing terhadap dataframe untuk mengakses column nilai dan kelas saja
2. Lakukan indexing terhadap dataframe untuk mengakses row 5 sampai 10 beserta column pelajaran dan nilai

In [29]:
# code here
print(df.loc[:,['nilai','kelas']],'\n')

print(df.loc[5:10,['pelajaran','kelas']],'\n')

    nilai kelas
0      32   12B
1      35   12C
2      24   12C
3      27   12D
4      63   12D
5      22   12C
6       8   12D
7      62   12C
8       5   12D
9      75   12C
10     79   12B
11     29   12A
12     73   12D
13     71   12C
14     88   12A
15     39   12B
16     45   12D
17     54   12A
18      6   12C
19     99   12D

   pelajaran kelas
5      Kimia   12C
6    Ekonomi   12D
7    Biologi   12C
8      Kimia   12D
9     Fisika   12C
10    Fisika   12B

<h2>Soal 2: Filter DataFrame Dengan Boolean</h2>

1. Tampilkan semua data siswa pada mata pelajaran Ekonomi dan Fisika
2. Tampilkan semua data siswa yang mempunyai nilai lebih dari 50 di mata pelajaran Kimia 
3. Tampilkan semua data yang mempunyai nilai lebih dari 70, berjnis kelamin perempuan dan di kelas 12C

In [30]:
# code here

Ekonomi = df.pelajaran == 'Ekonomi' 
Fisika = df.pelajaran == 'Fisika'
Kimia = df.pelajaran == 'Kimia'
nilai50 = df.nilai > 50
nilai70 = df.nilai > 70
perempuan = df.jenis_kelamin == 'perempuan'
kelas12C = df.kelas == '12C'

print(df[(Fisika) | (Ekonomi)],'\n')

print(df[(Kimia) & (nilai50)],'\n')

print(df[(perempuan) & (nilai70) & (kelas12C)],'\n')

    siswa_id pelajaran  nilai jenis_kelamin kelas
2          3   Ekonomi     24     laki-laki   12C
6          7   Ekonomi      8     laki-laki   12D
9         10    Fisika     75     laki-laki   12C
10        11    Fisika     79     laki-laki   12B
11        12   Ekonomi     29     laki-laki   12A
13        14   Ekonomi     71     laki-laki   12C
15        16   Ekonomi     39     laki-laki   12B
19        20    Fisika     99     perempuan   12D

   siswa_id pelajaran  nilai jenis_kelamin kelas
4         5     Kimia     63     perempuan   12D

Empty DataFrame
Columns: [siswa_id, pelajaran, nilai, jenis_kelamin, kelas]
Index: []

<h2>Soal 3: Data Transformation</h2>

lakukan data transformasi terhadap column 'nilai' dengan fungsi transformasi, berikut rumus dari normalisasi

![alt text](https://drive.google.com/uc?id=1wed-EbRSTA0JP1ceDp6lcKBqH2yJ4aa3)

In [33]:
# code here
def normalized(x):
    Xnormalized = (x - x.min())/(x.max() - x.min())
    return Xnormalized

print(df[['nilai']].apply(normalized))

       nilai
0   0.287234
1   0.319149
2   0.202128
3   0.234043
4   0.617021
5   0.180851
6   0.031915
7   0.606383
8   0.000000
9   0.744681
10  0.787234
11  0.255319
12  0.723404
13  0.702128
14  0.882979
15  0.361702
16  0.425532
17  0.521277
18  0.010638
19  1.000000